# SurfaceForegroundPatternColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SurfaceForegroundPatternColor Property
OverrideGraphicSettings Class See Also
---
The override color of the surface foreground pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public Color SurfaceForegroundPatternColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SurfaceForegroundPatternColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ SurfaceForegroundPatternColor {
	Color^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace